Repository: PatchiPup/Jarvis-Mark-II
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: es, fr, pt

source: Error capturing audio:
es: Error al capturar audio:
fr: Erreur lors de la capture audio:
pt: Erro ao capturar áudio:

source: Could not request results; {0}
es: No se pudieron solicitar resultados; {0}
fr: Impossible de recuperer les resultats ; {0}
pt: Não foi possível solicitar os resultados; {0}

source: Loaded command modules:
es: Módulos de comandos cargados:
fr: Modules de commande charges :
pt: Módulos de comando carregados:

source: Language updated to {lang}. Restart the application to apply changes.
es: Idioma actualizado a {lang}. Reinicie la aplicación para aplicar los cambios.
fr: Langue mise a jour en {lang}. Redemarrez l'application pour appliquer les modifications.
pt: Idioma atualizado para {lang}. Reinicie a aplicação para aplicar as mudanças.

source: Exiting the program
es: Saliendo del programa
fr: Fermeture du programme
pt: Encerrando o programa

source: Warning: No translation file found for {lang}, defaulting to English.
es: Advertencia: No se encontró un archivo de traducción para {lang}, predeterminado a inglés.
fr: Attention : aucun fichier de traduction trouve pour {lang}, utilisation de l'anglais par defaut.
pt: Aviso: Nenhum arquivo de tradução encontrado para {lang}, padrão para o inglês.

source: Press and hold {key} to communicate with Jarvis using your default microphone
es: Mantén presionado {key} para comunicarte con Jarvis usando tu micrófono predeterminado
fr: Appuyez et maintenez {key} pour communiquer avec Jarvis via votre microphone par defaut
pt: Pressione e segure {key} para se comunicar com o Jarvis usando seu microfone padrão

source: Listening...
es: Escuchando...
fr: En ecoute...
pt: Ouvindo...

source: You said:
es: Dijiste:
fr: Vous avez dit :
pt: Você disse:

source: Program Terminated
es: Programa terminado
fr: Programme termine
pt: Programa Encerrado

source: Error reading MUSIC_DIR:
es: Error al leer MUSIC_DIR:
fr: Erreur lors de la lecture de MUSIC_DIR :
pt: Erro ao ler MUSIC_DIR:

source: Playlist not found. Available playlists:
es: Lista de reproducción no encontrada. Listas disponibles:
fr: Liste de lecture non trouvee. Listes de lecture disponibles :
pt: Playlist não encontrada. Playlists disponíveis:

source: Playlist '{folder}' not found. Available playlists: {playlists}
es: Lista de reproducción '{folder}' no encontrada. Listas disponibles: {playlists}
fr: La liste de lecture '{folder}' n'a pas ete trouvee. Listes de lecture disponibles : {playlists}
pt: Playlist '{folder}' não encontrada. Playlists disponíveis: {playlists}

source: Recording Started!
es: Grabación iniciada!
fr: Enregistrement demarre !
pt: Gravação Iniciada!

source: Failed to start recording:
es: Error al iniciar la grabación:
fr: echec du demarrage de l'enregistrement :
pt: Falha ao iniciar a gravação:

source: Recording Stopped!
es: Grabación detenida!
fr: Enregistrement arrete !
pt: Gravação Parada!

source: Failed to stop recording:
es: Error al detener la grabación:
fr: echec de l'arret de l'enregistrement :
pt: Falha ao parar a gravação:

source: Error: Received status code {0} from {1}
es: Error: Código de estado {0} recibido de {1}
fr: Erreur : Code d'etat {0} reçu depuis {1}
pt: Erro: Código de status {0} recebido de {1}

source: Failed to get local commit: {0}
es: No se pudo obtener el commit local: {0}
fr: echec de recuperation du commit local : {0}
pt: Falha ao obter o commit local: {0}

source: {0} [y/n]:
es: {0} [s/n]:
fr: {0} [o/n]:
pt: {0} [s/n]:

source: Please respond with 'y' or 'n'.
es: Por favor, responda con 's' o 'n'.
fr: Veuillez repondre par 'o' ou 'n'.
pt: Por favor, responda com 's' ou 'n'.

source: Updating Jarvis with command:
es: Actualizando el Jarvis con el comando:
fr: Mise a jour du depot avec la commande :
pt: Atualizando Jarvis com o comando:

source: Update failed: {0}
es: La actualización falló: {0}
fr: Mise a jour echouee : {0}
pt: Atualizacao falhou: {0}

source: Could not determine commit information; skipping update check.
es: No se pudo determinar la información del commit; se omite la comprobación de actualización.
fr: Impossible de determiner les informations de commit ; verification de mise a jour ignoree.
pt: Nao foi possivel determinar as informacoes do commit; ignorando a verificacao de atualizacao.

source: Local commit: {0}
es: Commit local: {0}
fr: Commit local : {0}
pt: Commit local: {0}

source: Remote commit: {0}
es: Commit remoto: {0}
fr: Commit distant : {0}
pt: Commit remoto: {0}

source: Your Jarvis is up-to-date.
es: Su Jarvis está actualizado.
fr: Votre depot est a jour.
pt: Seu Jarvis esta atualizado.

source: A new commit is available.
es: Hay un nuevo commit disponible.
fr: Un nouveau commit est disponible.
pt: Um novo commit esta disponível.

source: Would you like to update?
es: ¿Desea actualizar?
fr: Voulez-vous mettre a jour ?
pt: Voce gostaria de atualizar?

source: Update successful. Restarting...
es: Actualización exitosa. Reiniciando...
fr: Mise a jour reussie. Redemarrage...
pt: Atualizacao bem-sucedida. Reiniciando...

source: Update failed.
es: La actualización falló.
fr: La mise a jour a echoue.
pt: Atualizacao falhou.

source: Update canceled by user.
es: Actualización cancelada por el usuario.
fr: Mise a jour annulee par l'utilisateur.
pt: Atualizacao cancelada pelo usuario.

source: Python could not be found to restart Jarvis, please manually re-open Jarvis.
fr: Python n'a pas pu etre trouve pour redemarrer Jarvis, veuillez rouvrir Jarvis manuellement.
pt: Nao foi possivel encontrar o Python para reiniciar o Jarvis.

source: Personality updated to {personality}. Restarting the application.
fr: Personnalite mise a jour en {personality}. Redémarrage de l'application.
pt: Personalidade atualizada para {personality}. Reiniciando a aplicacao.

source: Loading personality: {personality_name}
fr: Chargement de la personnalite : {personality_name}
pt: Carregando personalidade: {personality_name}

source: Warning: Personality '{personality_name}' not found. Falling back to 'jarvis'.
fr: Avertissement : Personnalite '{personality_name}' non trouvee. Retour a 'jarvis'.
pt: Aviso: Personalidade '{personality_name}' nao encontrada. Revertendo para 'jarvis'.
